//风险揭示书
export const RISK_REVEAL = {
    content: [
        {   id: '1',
            title: '（一）特殊风险揭示',
            content: [],
            children: [
                {   
                    id: '11',
                    title: '1、本基金合同是基于中国基金业协会发布的《私募投资基金合同指引1号》（契约型私募基金合同内容与格式指引）而制定的，管理人对合同指引相关内容做出了合理的调整以及增加了其他内容，导致基金合同与中国基金业协会合同指引不一致的风险。',
                    content: [],
                    children:[],
                },
                {
                    id: '12',
                    title: '2、基金管理人可以委托在中国证监会注册取得基金销售业务资格并已成为中国基金业协会会员的机构（以下简称代销机构）募集本基金，代销机构可能存在违法违规地公开宣传基金产品、虚假宣传基金产品、以保本保收益引诱投资者购买基金产品导致基金投资者合法权益受损的风险。',
                    content: [],
                    children:[],
                },
                {   
                    id: '13',
                    title: '3、基金管理人将本基金份额登记、估值核算等运营服务事项外包给招商证券股份有限公司办理，因外包机构经营风险、技术系统故障、操作失误等，可能使得外包事项发生差错，给本基金运营带来风险。',
                    content: [],
                    children: [],
                },
                { 
                    id: '14',
                    title: '4、基金管理人在基金募集完毕后20个工作日内向中国基金业协会办理基金备案手续。基金因未在中国基金业协会履行登记备案手续导致基金财产不能进行投资运作的风险。',
                    content: [],
                    children: [],
                },
            ]
        },
        {
            title: '（二）一般风险揭示',
            id: '2',
            content: [],
            children: [
                {
                    id: '21',
                    title: '1、资金损失风险',
                    content: [
                        '基金管理人依照恪尽职守、诚实信用、谨慎勤勉的原则管理和运用基金财产，但不保证基金财产中的认购资金本金不受损失，也不保证一定盈利及最低收益。',
                        '本基金属于高风险投资品种，适合风险识别、评估、承受能力为进取型的合格投资者。',
                    ],
                    children: []
                },
                {
                    id: '22',
                    title: '2、基金运营风险',
                    content: [
                        '基金管理人依据基金合同约定管理和运用基金财产所产生的风险，由基金财产及投资者承担。投资者应充分知晓投资运营的相关风险，其风险应由投资者自担。'
                    ],
                    children: []
                },
                {
                    id: '23',
                    title: '3、流动性风险',
                    content: [
                        '在本基金存续期内，投资者可能面临资金不能退出带来的流动性风险。',
                        '根据实际投资运作情况，本基金有可能提前结束或延期结束，投资者可能因此面临委托资金不能按期退出等风险。',
                    ],
                    children: []
                },
                {
                    id: '24',
                    title: '4、募集失败风险',
                    content: [
                        '本基金的成立需符合相关法律法规的规定，本基金可能存在不能满足成立条件从而无法成立的风险。',
                    ],
                    children: [
                        {
                            id: '241',
                            title: '基金管理人的责任承担方式：',
                            content: [
                                '（1）以其固有财产承担因募集行为而产生的债务和费用；',
                                '（2）在基金募集期限届满（确认基金无法成立）后三十日内返还投资人已交纳的款项，并加计银行同期存款利息。',
                            ],
                        }
                        
                    ]
                },
                {
                    id: '25',
                    title: '5、税收风险',
                    content: [
                        '契约性基金所适用的税收征管法律法规可能会由于国家相关税收政策调整而发生变化，投资者收益也可能因相关税收政策调整而受到影响。'
                    ],
                    children: []
                },
                {
                    id: '26',
                    title: '6、其他风险',
                    content: [
                        '包括但不限于法律与政策风险、发生不可抗力事件的风险、技术风险和操作风险等。'
                    ],
                    children: []
                },
            ]
        },
        {
            id: '3',
            title: '（三）基金投资风险揭示',
            content: [],
            children: [
                {
                    id: '31',
                    title: '1、市场风险',
                    content: [
                        '证券市场价格因受各种因素的影响而引起的波动，将使基金资产面临潜在的风险。市场风险可以分为股票投资风险和债券投资风险。',
                    ],
                    children: [
                        {
                            id: '311',
                            title: '（1）股票投资风险主要包括：',
                            content: [
                                '1）国家货币政策、财政政策、产业政策等的变化对证券市场产生一定的影响，导致市场价格水平波动的风险；',
                                '2）宏观经济运行周期性波动，对股票市场的收益水平产生影响的风险；',
                                '3）上市公司的经营状况受多种因素影响，如市场、技术、竞争、管理、财务等都会导致公司盈利发生变化，从而导致股票价格变动的风险。',
                                ],
                            },
                        {
                            id: '312',
                            title: '（2）债券投资风险主要包括：',
                            content: [
                                '1）市场平均利率水平变化导致债券价格变化的风险；',
                                '2）债券市场不同期限、不同类属债券之间的利差变动导致相应期限和类属债券价格变化的风险；',
                                '3）债券之发行人出现违约、拒绝支付到期本息，或由于债券发行人信用质量降低导致债券价格下降的风险。',
                            ],
                        },
                    ]
                },
                {
                    id: '32',
                    title: '2、基金管理人管理风险',
                    content: [
                        '在实际操作过程中，基金管理人可能限于知识、技术、经验等因素而影响其对相关信息、经济形势和证券价格走势的判断，其精选出的投资品种的业绩表现不一定持续优于其他投资品种。'
                    ],
                    children: []
                },
                {
                    id: '33',
                    title: '3、流动性风险',
                    content: [
                        '在市场或个股流动性不足的情况下，基金管理人可能无法迅速、低成本地调整投资计划，从而对基金收益造成不利影响。',
                        '在基金份额持有人提出追加或减少基金财产时，可能存在现金不足的风险和现金过多带来的收益下降风险。',
                    ],
                    children: []
                },
                {
                    id: '34',
                    title: '4、信用风险',
                    content: [
                        '本基金交易对手方发生交易违约或者基金持仓债券的发行人拒绝支付债券本息，导致基金财产损失。'
                    ],
                    children: []
                },
                {
                    id: '35',
                    title: '5、特定的投资方法及基金财产所投资的特定投资对象可能引起的特定风险',
                    content: [
                        '本基金采取的投资策略可能存在使基金收益不能达到投资目标或者本金损失的风险。'
                    ],
                    children: []
                },
                {
                    id: '36',
                    title: '6、操作或技术风险',
                    content: [
                        '相关当事人在业务各环节操作过程中，因内部控制存在缺陷或者人为因素造成操作失误或违反操作规程等引致的风险，例如，越权违规交易、会计部门欺诈、交易错误、IT系统故障等风险。',
                        '在基金的各种交易行为或者后台运作中，可能因为技术系统的故障或者差错而影响交易的正常进行或者导致基金份额持有人的利益受到影响。这种技术风险可能来自基金管理公司、基金外包机构、销售机构、证券交易所、证券注册登记机构等。',
                    ],
                    children: []
                },
                {
                    id: '37',
                    title: '7、基金本身面临的风险',
                    content: [],
                    children: [
                        {
                            id: '371',
                            title: '（1）法律及违约风险',
                            content: [
                                '在本基金的运作过程中，因基金管理人、基金托管人、证券经纪机构等合作方违反国家法律规定或者相关合同约定而可能对基金财产带来风险。'
                            ],
                            children: []
                        },
                        {
                            id: '372',
                            title: '（2）购买力风险',
                            content: [
                                '本基金的目的是基金财产的增值，如果发生通货膨胀，则投资于证券所获得的收益可能会被通货膨胀抵消，从而影响到基金财产的增值。'
                            ],
                            children: []
                        },
                        {
                            id: '373',
                            title: '（3）管理人不能承诺基金利益的风险',
                            content: [
                                '基金利益受多项因素影响，包括证券市场价格波动、投资操作水平、国家政策变化等，基金既有盈利的可能，亦存在亏损的可能。根据相关法律法规规定，管理人不对基金的投资者作出保证本金及其收益的承诺。'
                            ],
                            children: []
                        },
                        {
                            id: '374',
                            title: '（4）基金终止的风险',
                            content: [
                                '如果发生本合同所规定的基金终止的情形，管理人将卖出基金财产所投资之全部品种，并终止基金，由此可能导致基金财产遭受损失。'
                            ],
                            children: []
                        },
                    ]
                },
                {
                    id: '38',
                    title: '8、相关机构的经营风险',
                    content: [],
                    children: [
                        {
                            id: '381',
                            title: '（1）基金管理人经营风险',
                            content: [
                                '按照我国金融监管法律规定，虽基金管理人相信其本身将按照相关法律的规定进行营运及管理，但无法保证其本身可以永久维持符合监管部门的金融监管法律。如在基金存续期间基金管理人无法继续经营基金业务，则可能会对基金产生不利影响。'
                            ],
                            children: []
                        },
                        {
                            id: '382',
                            title: '（2）基金托管人经营风险',
                            content: [
                                '按照我国金融监管法律规定，基金托管人须获得中国证监会核准的证券投资基金托管资格方可从事托管业务。虽基金托管人相信其本身将按照相关法律的规定进行营运及管理，但无法保证其本身可以永久维持符合监管部门的金融监管法律。如在基金存续期间基金托管人无法继续从事托管业务，则可能会对基金产生不利影响。'
                            ],
                            children: []
                        },
                        {
                            id: '383',
                            title: '（3）证券、期货经纪商经营风险',
                            content: [
                                '按照我国金融监管法律规定，证券、期货公司须获得中国证监会核准的证券、期货经营资格方可从事证券、期货业务。虽证券、期货经纪商相信其本身将按照相关法律的规定进行营运及管理，但无法保证其本身可以永久维持符合监管部门的金融监管法律。如在基金存续期间证券、期货经纪商无法继续从事证券、期货业务，则可能会对基金产生不利影响。'
                            ],
                            children: []
                        }, 
                    ]
                },
                {
                    id: '39',
                    title: '9、关联交易风险（如有）',
                    content: [
                        '本基金可投资于由基金管理人、基金托管人或其关联方管理的产品或者与基金管理人、基金托管人或其关联方进行交易，这构成基金管理人与本基金的关联交易，存在关联交易风险。'
                    ],
                    children: []
                },
                {
                    id: '3100',
                    title: '10、净值波动风险',
                    content: [],
                    children: [
                        {
                            title: '按照本合同第十六章的估值方法，当本基金投资于基金管理公司及其子公司资产管理计划、证券公司及其子公司资产管理计划、信托计划、保险资产管理计划、期货公司资产管理计划、私募投资基金、有限合伙份额，有如下情形之一时：',
                            content: [
                                '（1）估值日无法及时获取上述投资品种的最新估值价格；',
                                '（2）投资上述品种后无法及时确认，上述投资品种在投资确认前估值价格波动；',
                                '（3）估值日取得的上述投资品种的最新估值价格没有或无法排除影响估值价格的因素（例如在估值日无法排除业绩报酬对估值价格的影响）；',
                                '（4）按照预期收益率反应的估值价格与实际兑付的收益产生差异；可能导致本基金的净值波动风险。'
                            ],
                            children: []
                        },
                    ]
                },
                {
                    id: '3110',
                    title: '11、其他风险',
                    content: [
                        '战争、自然灾害等不可抗力因素的出现，将会严重影响证券市场的运行，可能导致基金资产的损失。金融市场危机、行业竞争、代理机构违约等超出基金管理人自身直接控制能力之外的风险，可能导致基金份额持有人利益受损。',
                    ],
                    children: []
                },
                {
                    title: '',
                    content: [],
                    children: []
                },
            ]
        },
    ]
}
//产品状态
export const PRODUCT_STATUS = {
    0: '预热中',
    1: '募集中',
    2: '募集结束',
}
//货币类型
export const CURRENCY = {
    1: '元',
    2: '美元',
    3: '欧元',
    4: '英镑',
    5: '港币',
    6: '瑞士法郎',
    7: '加拿大元',
    8: '澳大利亚元',
    9: '新加坡元',
    10: '新西兰元',
    11: '日元',
}
//产品详情
export const PRODUCT = {
    id: 1, // 产品id
    name: '深蓝启明11号证券投资基金', // 产品名称
    no: 'PHCFTZ000003', // 内部产品编号
    categoryId: 3,  // 产品分类id
    categoryName: '海外类',  // 产品分类名称
    status: 2, // 0：预热中；1：募集中；2：募集结束；--1：无状态；
    minAmount: 100.00, // 起投金额，单位 万元
    currency: 1, // 币种 1：元；2：美元；3：欧元；4：英镑；5：港币；6：瑞士法郎；7：加拿大元；8：澳大利亚元；9：新加坡元；10：新西兰元；11：日元；
    term: '12个月', // 期限
    annualReturn: '6.5%-7.8%', // 年化收益基准
    seq: 1, // 产品排序
    netValue: 1.3300, // 净值
    riskLevel: 1, // 产品风险等级
    riskValue: 24, // 客户风险类型
    riskName: '进取型,激进型 ', // 风险类型名称
    riskyIcon: 'R2', // 风险等级
    termType: 1, // 期限类型 1表示 固定到期日  2表示固定期限  3表示周期性回款
    productLight: '', // 产品亮点
    introduction: '<h3>产品要素</h3><p> </p', // 产品介绍
    productReview: '新余市极吉投资中心（有限合伙）', // 产品点评
    productAnnouncement: '', // 产品公告
    productMarketingCopy: '民生品清二号FOF证券投资基金', // 产品营销文案
    riskInformation: '<div>风险揭示</div><div>（一）特殊风险揭示</div>', // 风险提示信息
    maxAmount: 1000000.00, // 最大认购金额范围
    rateRange: '[{"minAmount":100000,"maxAmount":1000000,"rate":1}]', // 收益率区间
    limits: '投资范围', // 投资范围
    scale: '产品费用', // 产品费用
    productSize: '产品规模', // 产品规模
    custodian: '招商银行', // 基金托管人
    fundManager: '基金管理人', // 基金管理人
    netWorth: { // 产品净值，购买后才会有
        date: '2017-07-16', // 日期
        value: 1121.3 // 净值
    },
    attachment: [{ // 产品附件
        name: '丰穗2号指导价', // 文件名称
        url: '1513052400351__1512985804656__丰穗2号指导价.pdf', // 附件地址
        type: 2, // 附件类型 0：img；1：txt；2：pdf；3：video；99：others
        videoTranscoded: 0, // 视频是否转码
        createTime: '2017-11-20 11:33:36' // 创建时间
    }]
}